In [ ]:
  =============== EDA ================

1) Pandas         : Dataframe or Data applications
2) Numpy          : Numerical python for math operations
3) matplotlib     : For plots graphs
4) Seaborn        : For plots graphs
5) Bokhe          : For plots
6) plotly         : For plots


=============== Machine Learning  ============
7) Scikit learn(SKlearn) : ML models
8) stats                 : statistical models


=============== Data retrival from sql scrapping======
9) Sqlite                 : connect with database
10) Beautiful soup        : scrap the data from website
11) websocket             : scrap

================= Deep Learning/computer vision =========
12) Tensorflow            : Google
13) Keras                 
14) OpenCV                : Image operations
15) Pillow (PIL)          : Image operations
16) Pytorch               : Facebbok
17) Pretrained model 
     VGG16
     Mobilenet
     RESNET
     RCNN
     MASKRCNN
     FASTERCNN
     YOLO

================= Natural language process ============
18) NLTK               : Natural language process
19) scipy
20) Word2vec (How words will convert into vector) :
21) GloVE
22) Wordcloud

================== Hugging face ===================
23) Transformers        : BERT ( Bidirectional encoder representation of transfer)

================== GenAI models ===================
24) OpenAI+Microsoft     : GPT Models
25) Google               : Gemini
26) Amazon               : Q
27) Meta Facebook        : MetaAI
28) Apple 

LLAMA
GEMMA
Dalle-E
T5

All are having different different packages

=================== LANGCHAIN ===============
29) LangChain Framework

==================  Deployments/applications ============
30) Flask
31) streamlit
32) Django

=================== MLops =======================
33) Mlflow
34) Kubeflow
35) Azure Ai services : azure packages
36) GCP : GCP packages

**Step-1**

**Create a Dataframe**
- We will create a dataframe using list
- We will create a dataframe using dictionary

In [1]:
import pandas as pd

In [3]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [4]:
type(d1)

pandas.core.frame.DataFrame

**Step-2**

**Provide the data**

In [5]:
names=['devi','surekha','ramya']
pd.DataFrame(names)

         0
0     devi
1  surekha
2    ramya

In [6]:
names=['devi','surekha','ramya']
age=[20,21,22]
pd.DataFrame(zip(names,age))

         0   1
0     devi  20
1  surekha  21
2    ramya  22

In [7]:
names=['devi','surekha','ramya']
age=[20,21,22]
data=zip(names,age)
pd.DataFrame(data)

         0   1
0     devi  20
1  surekha  21
2    ramya  22

In [9]:
names=['devi','surekha','ramya']
age=[20,21,22]
city=['Blr','Hyd','Delhi']
data=zip(names,age,city)
pd.DataFrame(data)

         0   1      2
0     devi  20    Blr
1  surekha  21    Hyd
2    ramya  22  Delhi

**Step-3**

**Provide the column names**

In [10]:
names=['devi','surekha','ramya']
pd.DataFrame(names, columns=['Names'])

     Names
0     devi
1  surekha
2    ramya

In [12]:
names=['devi','surekha','ramya']
age=[20,21,22]
data=zip(names,age)
pd.DataFrame(data, columns=['Names','Age'])

     Names  Age
0     devi   20
1  surekha   21
2    ramya   22

In [13]:
names=['devi','surekha','ramya']
age=[20,21,22]
city=['Hyd','Blr','Delhi']
pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'])

     Names  Age   City
0     devi   20    Hyd
1  surekha   21    Blr
2    ramya   22  Delhi

**Step-4**

**Providing index**

In [14]:
names=['devi','surekha','ramya']
age=[20,21,22]
city=['Hyd','Blr','Delhi']
ix=['A','B','C']
pd.DataFrame(zip(names,age,city),index=ix,columns=['Names','Age','City'])

     Names  Age   City
A     devi   20    Hyd
B  surekha   21    Blr
C    ramya   22  Delhi

In [15]:
names=['devi','surekha','ramya']
age=[20,21,22]
city=['Hyd','Blr','Delhi']
data=zip(names,age,city)
ix=['A','B','C']    # 3 rows we need 3 index
cols=['Names','Age','City'] # 3 columns, 3 values
pd.DataFrame(data,index=ix,columns=cols)

     Names  Age   City
A     devi   20    Hyd
B  surekha   21    Blr
C    ramya   22  Delhi

In [17]:
names=['devi','surekha','ramya']
age=[20,21,22]
city=['Hyd','Blr','Delhi']
data=zip(names,age)
cols=['Names','Age'] 
pd.DataFrame(data,index=city,columns=cols)

         Names  Age
Hyd       devi   20
Blr    surekha   21
Delhi    ramya   22

In [18]:
names=['devi','surekha','ramya']
age=[20,21,22]
city=['Hyd','Blr','Delhi']
data=zip(names,age)
cols=['Names','Age'] 
df= pd.DataFrame(data,index=city,columns=cols)
df

         Names  Age
Hyd       devi   20
Blr    surekha   21
Delhi    ramya   22

**Step-5**

**Add a new column on existing dataframe**

In [19]:
# create a dataframe 
# Name
# age
# city

import pandas as pd
names=['devi','surekha','ramya']
age=[20,21,22]
city=['Hyd','Blr','Delhi']

data=zip(names,age,city)
cols=['Names','Age','City'] 
df= pd.DataFrame(data,columns=cols)
df

     Names  Age   City
0     devi   20    Hyd
1  surekha   21    Blr
2    ramya   22  Delhi

- If you want to add a new column
- First check how many rows are there
- For example in above dataframe we have 3 rows
- Your new column also should have 3 rows
- Suppose I want to create a new column : **Salary**
- make a list with 3 values

- salary=[1000000, 500000, 600000]

**syntax**: dataframe[column]=list of values

-  df['salary']=salary

In [21]:
salary=[1000000, 500000, 600000]
df['salary']=salary
df

     Names  Age   City   salary
0     devi   20    Hyd  1000000
1  surekha   21    Blr   500000
2    ramya   22  Delhi   600000

**use case-1**

- Create empty data frame first
- create 3 list using list comprehension
- list1= a values from 1 to 10
- list2 = square of 1 to 10
- list3 = cube of 1 to 10
- Finally make a dataframe

In [30]:
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [31]:
l1=[i for i in range(1, 10)]
l1

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [32]:
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df1['X']=l1
df1['Y']=l2
df1['Z']=l3
df1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

**Step-6**

**Update the already existed column**

- Create a new column
   - creating a new list  salary=[1000000, 500000, 600000]
   - df['S']
   - Creating a new column and the column name is our choice
- update existing column are same way only
   - Here also we need to make a list of values = number of rows
   - while updating the existing column
   - we need to provide already existed column name only
   - df['Z'] = list of values

In [33]:
# dataframe name: df1
# list of values variable name: z
# which column we want to update : 'Z'
z=[i**4 for i in range(1,10)]
df1['Z']=z
df1

   X   Y     Z
0  1   1     1
1  2   4    16
2  3   9    81
3  4  16   256
4  5  25   625
5  6  36  1296
6  7  49  2401
7  8  64  4096
8  9  81  6561

**Step-7**

**Drop the column**

In [28]:
# How to check the columns
df1.columns

Index(['X', 'Y', 'Z'], dtype='object')

- If you want to drop a specific column
- we will use drop method
- we already know about difference between keywords and methods
- keywords will use with corresponding dataframe
- **Method name: drop**

df1.drop()

- Column: which column youn want to drop
- axis: Represents the specified alue is a row or column

        - axis = 0 means rows
        - axis = 1 means column
- inplace: will provide overwrite the dataframe or not

        - inplace= True, this indicates overwrite the dataframe
        - inplace= False, this indicates the modified dataframe will be use when
              you provide new variable for the operation

In [34]:
df1.drop('X')
# we are not providing axis
# it is assuming the provided value is a row
# by default axis=0 ===== rows

KeyError: "['X'] not found in axis"

In [35]:
df1.drop('X', axis=1)

# after this in a new cell type df1=
# you will see original daatframe
# because we did not provide inplace

# If you want to use below output
# you need to assign a variable
# df_new=df1.drop('X', axis=1)

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

In [36]:
df1

   X   Y     Z
0  1   1     1
1  2   4    16
2  3   9    81
3  4  16   256
4  5  25   625
5  6  36  1296
6  7  49  2401
7  8  64  4096
8  9  81  6561

In [37]:
df1.drop('X',axis=1, inplace=True)
df1

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

**Step-8**

**drop the row**

- drop the column and drop the rows are similar only
- the only difference is axis

      - axis = 0 represents rows
      - by default axis = 0 available
      - which means if we provide any value, it will represent rows only

In [51]:
import pandas as pd
df1=pd.DataFrame()


l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df1['X']=l1
df1['Y']=l2
df1['Z']=l3
df1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

In [41]:
df1.drop(4)
# If we run this we will get error
# by default axis=0 which represents about rows
# But 'Number' is a column
# If you want to drop row, then provide the row index

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

In [42]:
# Multiple rows
# Multiple columns keep always in a list

df1.drop([4,8])

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
5  6  36  216
6  7  49  343
7  8  64  512

In [43]:
df1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

In [46]:
df1.columns[0]

'X'

In [47]:
df1.columns[[0,1]]

Index(['X', 'Y'], dtype='object')

In [48]:
df1.drop([0,1], axis=1)
# [0,1] index
# axis=1 columns
# error

KeyError: '[0, 1] not found in axis'

**Step-9**

**How to select the column**

In [49]:
df1['X']

# Series type
# No column name display
# whenever you see this type : series type

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: X, dtype: int64

In [52]:
df1[['X']]

   X
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [53]:
df1[['Y']]
# Dataframe

    Y
0   1
1   4
2   9
3  16
4  25
5  36
6  49
7  64
8  81

In [55]:
type(df1['Y'])

pandas.core.series.Series

In [56]:
type(df1[['X']])

pandas.core.frame.DataFrame

In [57]:
df1.X

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: X, dtype: int64

- df1['X']: Series type
- df1[['X']] : Dataframe type
- df1.X: Series type

In [58]:
cols=['X','Y']
df1[cols]

   X   Y
0  1   1
1  2   4
2  3   9
3  4  16
4  5  25
5  6  36
6  7  49
7  8  64
8  9  81

In [59]:
df1['X'].values

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

- All values comes in an array
- Array means it is a list of elements only represents using numpy package
- Generally elements present in 4 ways

      - List            : Basic representations
      - Numpy array     : Array with Numpy package
      - Tensors         : Tensorflow package
      - Torch           : Pytorch package

In [60]:
list1=[1,2,3,4]
list1

[1, 2, 3, 4]

In [76]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4])

In [ ]:
#tensor([1,2,3,4])

In [77]:
list1=[1,2,3,4]
list2=[10,20,30,40]
list1+list2

[1, 2, 3, 4, 10, 20, 30, 40]

In [78]:
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([11, 22, 33, 44])

In [79]:
df1['X'].values
# Imagine we worked on a ML problem
# we got some series of values
# With that series of values also we can create a dataframe

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [80]:
df1['x']=df1['X'].values
df1

   X   Y    Z  x
0  1   1    1  1
1  2   4    8  2
2  3   9   27  3
3  4  16   64  4
4  5  25  125  5
5  6  36  216  6
6  7  49  343  7
7  8  64  512  8
8  9  81  729  9

**Step-10**

**Save the dataframe**

- Dataframes we can save in two formats

     - CSV : Comma seperated  value
     - xlsx : excel format

- In order to save my data
     
     - where you want to save : directory name
     - what is the name of the file for storing
     - what is the extension

- we already seen same in file handling session

In [ ]:
#Case-1: Saving file at same location where this python file
# import os
# os.getcwd()
# No need to provide directory path
# Directly give only name of the file
# and extension

In [81]:
# Dataframe name: df1
df1.to_csv('Data1.csv')
df1.to_excel('Data1.xlsx')

**Step-11**

**How to read a dataframe**

In [82]:
import pandas as pd
pd.read_csv('Data1.csv')

   Unnamed: 0  X   Y    Z  x
0           0  1   1    1  1
1           1  2   4    8  2
2           2  3   9   27  3
3           3  4  16   64  4
4           4  5  25  125  5
5           5  6  36  216  6
6           6  7  49  343  7
7           7  8  64  512  8
8           8  9  81  729  9

In [83]:
import os
os.getcwd()

'C:\\Users\\HP\\OneDrive\\Documents\\Datascience\\EDA'

In [84]:
import pandas as pd
pd.read_excel('Data1.xlsx')

   Unnamed: 0  X   Y    Z  x
0           0  1   1    1  1
1           1  2   4    8  2
2           2  3   9   27  3
3           3  4  16   64  4
4           4  5  25  125  5
5           5  6  36  216  6
6           6  7  49  343  7
7           7  8  64  512  8
8           8  9  81  729  9

**Step-12**

**How to avoid index column**

- while we save the dataframe
- automatically a new column will create
- that we will need to avoid
- permission denied means close the data file from laptop

In [86]:
# Dataframe name: df1
# save the data without index column
df1.to_csv('Data1.csv', index=False)
df1.to_excel('Data1.xlsx', index=False)

In [87]:
# read the data
import pandas as pd
pd.read_csv('Data1.csv')

   X   Y    Z  x
0  1   1    1  1
1  2   4    8  2
2  3   9   27  3
3  4  16   64  4
4  5  25  125  5
5  6  36  216  6
6  7  49  343  7
7  8  64  512  8
8  9  81  729  9